glcloud/keil_v5/ARM/PACK/.Web/Keil.SAMD21_DFP.pdsc
        <!-- *************************  Device 'ATSAMD21E16B'  **************************** -->
        <device Dname="ATSAMD21E16B">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21E16B__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21E16B.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000800"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64.FLM"         start="0x00000000" size="0x00010000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64_EEPROM.FLM"  start="0x00400000" size="0x00000800" default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E16BU'  *************************** -->
        <device Dname="ATSAMD21E16BU">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21E16BU__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21E16BU.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000800"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64.FLM"         start="0x00000000" size="0x00010000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64_EEPROM.FLM"  start="0x00400000" size="0x00000800" default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E16L'  *************************** -->
        <device Dname="ATSAMD21E16L">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21E16L__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21E16L.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000800"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64.FLM"         start="0x00000000" size="0x00010000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64_EEPROM.FLM"  start="0x00400000" size="0x00000800" default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E17A'  **************************** -->
        <device Dname="ATSAMD21E17A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21E17A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21E17A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E18A'  **************************** -->
        <device Dname="ATSAMD21E18A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21E18A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21E18A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

