glcloud/keil_v5/ARM/PACK/.Web/Keil.SAMD21_DFP.pdsc
          <feature type="IOs"           n="38"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"              name="ADC"/>
          <feature type="Timer"         n="6"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="48"                          name="QFN Package"/>
          <feature type="QFP"           n="48"                          name="TQFP Package"/>
          <feature type="CSP"           n="48"                          name="WLCSP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21G16L'  **************************** -->
        <device Dname="ATSAMD21G16L">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21G16L__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21G16L.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000800"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64.FLM"         start="0x00000000" size="0x00010000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64_EEPROM.FLM"  start="0x00400000" size="0x00000800" default="1"/>

          <feature type="IOs"           n="38"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="14"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="48"                          name="QFN Package"/>
          <feature type="QFP"           n="48"                          name="TQFP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21G17A'  **************************** -->
        <device Dname="ATSAMD21G17A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21G17A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21G17A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <feature type="IOs"           n="38"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"              name="ADC"/>
          <feature type="Timer"         n="6"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="48"                          name="QFN Package"/>
          <feature type="QFP"           n="48"                          name="TQFP Package"/>
          <feature type="CSP"           n="48"                          name="WLCSP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21G17AU'  *************************** -->
        <device Dname="ATSAMD21G17AU">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21G17AU__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21G17AU.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <feature type="IOs"           n="38"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"              name="ADC"/>
          <feature type="Timer"         n="6"       m="32"              name="Timer/Counter Module"/>
        </device>

        <!-- *************************  Device 'ATSAMD21G18A'  **************************** -->
        <device Dname="ATSAMD21G18A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21G18A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21G18A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="IOs"           n="38"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"              name="ADC"/>
          <feature type="Timer"         n="6"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="48"                          name="QFN Package"/>
          <feature type="QFP"           n="48"                          name="TQFP Package"/>
          <feature type="CSP"           n="48"                          name="WLCSP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21G18AU'  *************************** -->
        <device Dname="ATSAMD21G18AU">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21G18AU__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21G18AU.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

