glcloud/keil_v5/ARM/PACK/.Web/Keil.SAMD21_DFP.pdsc
          <feature type="IOs"           n="38"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"              name="ADC"/>
          <feature type="Timer"         n="6"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="48"                          name="QFN Package"/>
          <feature type="QFP"           n="48"                          name="TQFP Package"/>
          <feature type="CSP"           n="48"                          name="WLCSP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21J15A'  **************************** -->
        <device Dname="ATSAMD21J15A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21J15A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21J15A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"              name="ADC"/>
          <feature type="Timer"         n="8"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="64"                          name="QFN Package"/>
          <feature type="QFP"           n="64"                          name="TQFP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21J15B'  **************************** -->
        <device Dname="ATSAMD21J15B">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21J15B__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21J15B.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00008000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000400"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" default="1" init   ="0"/>
          <algorithm name="Flash/ATSAMD21_32.FLM"         start="0x00000000" size="0x00008000" default="1"/>
          <algorithm name="Flash/ATSAMD21_32_EEPROM.FLM"  start="0x00400000" size="0x00000400" default="1"/>

          <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"              name="ADC"/>
          <feature type="Timer"         n="8"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="64"                          name="QFN Package"/>
          <feature type="QFP"           n="64"                          name="TQFP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21J16A'  **************************** -->
        <device Dname="ATSAMD21J16A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21J16A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21J16A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"              name="ADC"/>
          <feature type="Timer"         n="8"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="64"                          name="QFN Package"/>
          <feature type="QFP"           n="64"                          name="TQFP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21J16B'  **************************** -->
        <device Dname="ATSAMD21J16B">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21J16B__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21J16B.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000800"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64.FLM"         start="0x00000000" size="0x00010000" default="1"/>
          <algorithm name="Flash/ATSAMD21_64_EEPROM.FLM"  start="0x00400000" size="0x00000800" default="1"/>

          <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"              name="ADC"/>
          <feature type="Timer"         n="8"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="64"                          name="QFN Package"/>
          <feature type="QFP"           n="64"                          name="TQFP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21J17A'  **************************** -->
        <device Dname="ATSAMD21J17A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21J17A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21J17A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"              name="ADC"/>
          <feature type="Timer"         n="8"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="64"                          name="QFN Package"/>
          <feature type="QFP"           n="64"                          name="TQFP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21J18A'  **************************** -->
        <device Dname="ATSAMD21J18A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21J18A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21J18A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"              name="ADC"/>
          <feature type="Timer"         n="8"       m="32"              name="Timer/Counter Module"/>
          <feature type="QFN"           n="64"                          name="QFN Package"/>
          <feature type="QFP"           n="64"                          name="TQFP Package"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="SAMD21xA CMSIS">
      <description>Microchip SAM D21 devices and CMSIS-CORE</description>
      <require Dvendor="Microchip:3" Dname="ATSAMD21[EGJ]1[5678][A]*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="SAMD21xB CMSIS">
      <description>Microchip SAM D21 devices and CMSIS-CORE</description>
      <require Dvendor="Microchip:3" Dname="ATSAMD21[EGJ]1[5678][BL]*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAMD21 CMSIS">
      <description>Microchip SAM D21 devices and CMSIS-CORE</description>
      <require Dvendor="Microchip:3"  Dname="ATSAMD21*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

