glcloud/keil_v5/ARM/PACK/.Web/Keil.SAMD21_DFP.pdsc
  </conditions>

  <components>
    <!-- Startup SAMD21xA -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="SAMD21xA CMSIS">
      <description>System Startup for Microchip SAM D21 Devices</description>
      <files>
        <file category="include"   name="Device/SAMD21A/Include/"/>
        <file category="source"    name="Device/SAMD21A/Source/ARM/startup_SAMD21.s" attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"    name="Device/SAMD21A/Source/system_samd21.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SAMD21xB -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="SAMD21xB CMSIS">
      <description>System Startup for Microchip SAM D21 Devices</description>
      <files>
        <file category="include"   name="Device/SAMD21B/Include/"/>
        <file category="source"    name="Device/SAMD21B/Source/ARM/startup_SAMD21.s" attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"    name="Device/SAMD21B/Source/system_samd21.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- SAMD21-XPRO Board Support -->
    <bundle Cbundle="SAMD21-XPRO" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAMD21-XPRO Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="SAMD21 CMSIS">
      <description>LED driver for Microchip SAMD21-XPRO Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAMD21-XPRO/Common/LED_SAMD21-XPRO.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="SAMD21 CMSIS">
      <description>Button driver for Microchip SAMD21-XPRO Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAMD21-XPRO/Common/Buttons_SAMD21-XPRO.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board vendor="Atmel" name="SAMD21-XPRO" revision="Rev.5" salesContact="http://www.atmel.com/buy/contact_us.aspx?contactType=Sales%20Representative" orderForm="http://store.atmel.com/product.ashx?sku=ATSAMD20-XPRO&amp;tool_id=">
      <description>Atmel SAM D21 Xplained Pro Evaluation Kit</description>
      <image small="Boards/Atmel/SAMD21-XPRO/Documents/SAMD21-XPRO_small.jpg"
             large="Boards/Atmel/SAMD21-XPRO/Documents/SAMD21-XPRO_large.jpg"/>
      <book category="overview"  name="http://www.atmel.com/tools/ATSAMD21-XPRO.aspx" title="SAM D21 Xplained Pro Evaluation Kit Web Page"/>
      <book category="manual"    name="Boards/Atmel/SAMD21-XPRO/Documents/Atmel-42220-SAMD21-Xplained-Pro_User-Guide.pdf" title="User Guide"/>
      <book category="other"     name="Boards/Atmel/SAMD21-XPRO/Documents/Atmel-42220-SAMD21-Xplained-Pro_User-Guide.zip" title="Schematics and Gerber files"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAMD21J18A"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" Dfamily="SAM D21"/>
	    <feature type="ODbg"      n="1"              name="Embedded Debugger USB"/>
		<feature type="XTAL"      n="32768"/>
	    <feature type="PWR"       n="5"              name="USB Powered (from the Debugger)"/>
	    <feature type="PWR"       n="5"              name="External Power"/>
	    <feature type="DIO"       n="3"              name="Xplained Pro Extension headers"/>
	    <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
	    <feature type="LED"       n="1"              name="Yellow User LED"/>
	    <feature type="USB"       n="1"              name="Target USB"/>
	    <feature type="CustomFF"  n="60" m="100"/>
      <debugInterface adapter="Embedded Debugger" connector="Micro-USB"/>
    </board>
  </boards>

  <examples>
    <!-- SAMD21-XPRO Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="Boards/Atmel/SAMD21-XPRO/RTX5_Blinky">
      <description>CMSIS-RTOS2 based Blinky example</description>
      <board name="SAMD21-XPRO" vendor="Atmel"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
